#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results output :session *R:etf-alloc* :width 560 :height 420

*** All Period

#+begin_src R :colnames yes
perf_summary(r_xts)
#+end_src

#+RESULTS:
:   Symbol Sharpe Avg_Ret Cum_Ret StdDev  MaxDD
: 1    QQQ   0.62  12.53% 426.59% 20.35% 53.41%
: 2    VNQ   0.25   7.75% 186.03% 31.15% 72.91%
: 3    TLT   0.51   6.94% 156.97% 13.67% 26.59%
: 4    GLD   0.49   9.09% 240.38% 18.54% 45.56%

*** 2010 -

#+begin_src R :colnames yes
perf_summary(r_xts["2010::"])
#+end_src

#+RESULTS:
:   Symbol Sharpe Avg_Ret Cum_Ret StdDev  MaxDD
: 1    QQQ   0.96  16.79% 347.51% 17.42% 22.79%
: 2    VNQ   0.68  12.23% 204.60% 18.07% 22.63%
: 3    TLT   0.62   8.42% 118.32% 13.69% 20.48%
: 4    GLD   0.21   3.22%  35.82% 15.64% 45.56%

*** Average

#+begin_src R
map(models, ~ mean_weight(all_models[[.x]]$weight)) %>%
reduce(left_join, by = "symbol") %>%
set_names(c("symbol", models))
#+end_src

#+RESULTS:
#+begin_example

# A tibble: 4 x 5
  symbol hist       ccc        dcc        deco
  <
 <
<
<
<formttbl>
1 GLD    17.05%     19.27%     19.22%     24.79%
2 QQQ    30.59%     32.57%     31.78%     24.62%
3 TLT    48.28%     40.90%     40.38%     33.40%
4 VNQ    4.08%      7.25%      8.62%      17.19%
#+end_example

** Performance Summary

#+begin_src R
perf_summary(perfs)
#+end_src

#+RESULTS:
:   Symbol Sharpe Avg_Ret Cum_Ret StdDev  MaxDD
: 1   Hist   1.33  11.38% 267.88%  8.53% 12.22%
: 2    CCC   1.49  12.79% 328.32%  8.61% 10.96%
: 3    DCC   1.45  12.52% 316.21%  8.62% 11.38%
: 4   DECO   1.27  11.72% 281.87%  9.26% 12.08%

*** CCC

#+begin_src R
ccc_perf <- perfs[, "CCC"]
years <- as.character(unique(year(index(perfs))))
map_dfr(years, function(year) {
  a_perf <- ccc_perf[year]
  perf_summary(a_perf) %>%
    mutate(Year = year) %>%
    select(Year, everything(), -Symbol)
}) %>%
  mutate_at(vars(-Year, -Sharpe), percent)
#+end_src

#+RESULTS:
#+begin_example

   Year Sharpe Avg_Ret Cum_Ret StdDev  MaxDD
1  2007   3.76  28.68%  11.41%  7.62%  3.93%
2  2008   1.27  14.13%  14.19% 11.09% 10.96%
3  2009   0.67   7.61%   7.61% 11.42%  9.84%
4  2010   1.86  17.13%  17.13%  9.21%  4.15%
5  2011   2.49  24.53%  24.53%  9.84%  3.92%
6  2012   2.02  12.93%  12.82%  6.40%  3.67%
7  2013   0.35   3.02%   3.02%  8.52%  8.83%
8  2014   2.65  16.69%  16.69%  6.29%  3.23%
9  2015   0.07   0.63%   0.63%  8.79%  8.59%
10 2016   0.96   7.58%   7.58%  7.93%  9.70%
11 2017   3.25  20.73%  20.64%  6.37%  3.93%
12 2018  -0.10  -0.81%  -0.81%  8.37%  7.37%
13 2019   5.02  34.64%  22.08%  6.90%  1.67%
There were 50 or more warnings (use warnings() to see the first 50)
#+end_example

*** DCC

#+begin_src R
dcc_perf <- perfs[, "DCC"]
years <- as.character(unique(year(index(perfs))))
map_dfr(years, function(year) {
  a_perf <- dcc_perf[year]
  perf_summary(a_perf) %>%
    mutate(Year = year) %>%
    select(Year, everything(), -Symbol)
}) %>%
  mutate_at(vars(-Year, -Sharpe), percent)
#+end_src

#+RESULTS:
#+begin_example

   Year Sharpe Avg_Ret Cum_Ret StdDev  MaxDD
1  2007   3.68  27.74%  11.06%  7.53%  3.87%
2  2008   1.20  13.57%  13.63% 11.35% 11.38%
3  2009   0.62   7.10%   7.10% 11.39%  9.78%
4  2010   1.79  16.67%  16.67%  9.34%  4.19%
5  2011   2.63  25.45%  25.45%  9.66%  3.67%
6  2012   2.07  13.18%  13.07%  6.36%  3.88%
7  2013   0.21   1.83%   1.83%  8.54%  8.51%
8  2014   2.50  15.86%  15.86%  6.35%  3.35%
9  2015   0.07   0.61%   0.61%  8.82%  8.73%
10 2016   0.88   7.02%   7.02%  7.95%  9.97%
11 2017   3.21  20.26%  20.17%  6.32%  3.83%
12 2018  -0.09  -0.72%  -0.72%  8.24%  7.34%
13 2019   5.20  35.79%  22.77%  6.88%  1.58%
There were 50 or more warnings (use warnings() to see the first 50)
#+end_example
